# オブジェクト指向
# 「物(object)」をベースにシステムを開発する
# ※人にやさしい

# Class
# 「物」の設計図
# ファイル名とかフォルダ名みたいなやつ
# [書式]
# class クラス名:
#     物が持っている特性
class User:
    pass
# これで、Userという名前の白紙の設計図が完成

# 物は、設計図から製造されて、初めて使えるようになる
# 出来上がった物は、インスタンス(実体)と呼ばれる
# ※オブジェクトともいう
# また、その製造工程を「実体(インスタンス)化」という

# まずはものを作らないといけない
# インスタンス化のやり方は、「クラス名()」
User()
# User() が完成
# おまけ
# 他言語では、new User()といったように、newキーワードを用いるのが一般的

# 上のコードだと、実体化されたインスタンスが放置されているので変数に格納する
# ただ10ってあっても何もできないのと同じ感じ
user = User()

print(user) # <__main__.User object at 0x000001ACD2109F10> at の後ろはアドレス

# おまけ
# クラス名の先頭1文字目は大文字が慣例
# 例）
# Product -> 〇 
# product -> ✕